users = {}


greetings = """
<b>Салют. Этот бот создан в качестве помощника для пользователей сервиса.</b>
Чтобы увидеть список доступных комманд начни вводить в чате / или воспользуйся кнопкой Меню в мобильной версии.
"""

information_text = """
<b>Пара слов о проекте.</b> 
Софт крайне похож по принципу действия на классический VPN, но в отличии от него <b>использует продвинутую технологию 
Shadowsoks, которая активно используется в Китае, потому что позволяет обходить великий китайский фаерволл, в отличие от 
многих других решений.</b>

Кроме того сам  проект с открытым кодом, который постоянно доступен всем желающим. Такие проекты изучают тысячи 
разработчиков со всего мира, что исключает возможность появления там скрытых уязвимостей и лазеек для утечки информации.

Более того, независимый аудит продукта проводила организация <b>Radically Open Security.</b>

Также важно понимать, что <b>у любого стандартного VPN остается сигнатурный след</b>, собственно через него РКН и ведет 
борьбу VPN сервисами, а вот программы работающие на основе технологии Shadowsocks <b>очень сложно отследить и 
заблокировать</b>, а все благодаря маскировке трафика под HTTPS. В критическом случае всегда можно развернуть новый 
сервер и продолжить серфить по сети, в среднем это занимает <b>15 минут.</b>
"""

download_text = """
Для работы переходите по ссылке и устанавливаете на нужную вам платформу <b>клиент❗</b>, ссылка ниже, скрольте 
открывшуюся страницу вниз.
 
https://getoutline.org/ru/get-started/#step-3

Я присылаю вам ключ для подключения, вставляете его в программе-клиенте, 
подключаетесь к серверу и вуаля вы в свободном интернете.
Данный ключ можно использовать на всех устройствах.
"""

important_info_text = """
<b>Несколько важных моментов.</b> 

Если вдруг законодательство  РФ в отношении систем обхода блокировок изменится, скорее всего придется прикрыть лавочку 
(но это не точно 😈).

<b>Этот проект не предназначен для использования в коммерческих целях</b>, что я хочу этим сказать. 
Если вы хотите на это сервак подключить свой офис, то эта движуха не для вас. 
Надо понимать что возможности сервера рассчитаны только для личного пользования, 
<b>высокая нагрузка повлияет на всех пользователей !!!</b> 
Если вы думаете, что у вас получится схитрить, то нет, не получится, 
в технические подробности вдаваться не буду, просто поверьте.

<b>В идеале ключ доступа предоставляется для пользования одному человеку на всех его устройствах.</b> 
Сделано это не из-за моей жадности, а опять же из-за расчетов той нагрузки, который может выдержать сервер и его 
пропускная способность. Очень рассчитываю на вашу адекватность.

<b>Сервис запущен для свободного  доступа к интернету, а не для нарушения законодательства. 
Поэтому не стоит через него покупать то, чего нет в открытой продаже. Этими действиями вы подставляете не только себя 
но и меня.</b>

Кроме того рекомендую не удалять VPN сервис которым вы пользовались до этого. 
Он может вам пригодится для доступа к интернету в случае, если это сервис будет недоступен 
из-за каких-либо критических проблем (благо пока такого не случалось).

<b>Помните что VPN — это средство приватности, но не средство анонимности.</b> Для анонимности используйте, например 
связку VPN + Tor — это, в принципе, довольно неплохой вариант,<b> но далеко не идеальный.</b> Не надо расслабляться и 
забывать о безопасности, занимайтесь самообразованием, читайте про безопасность и анонимность в сети.  🕊
"""

payments_text = """
В настоящий данный момент, <b>сумма взноса составляет 300 руб.</b> в месяц с человека. 
В будущем сумма может изменится как в большую так и в меньшую, в зависимости от курса евро (серверы находятся в 
Скандинавии) и колличетсва пользователей.

Перевод на карту банка, через СБП, по номеру телефона. Тем у кого его нет отправлю в личку телеграмма. 

Принцип оплаты такой. Если вы начали пользоваться сервером 23 числа, то последующие переводы нужно осуществлять за 
минусом двух дней, иными словами все последующий ежемесячные переводы должны быть 21го числа.
"""

help_text = "Если возникли вопросы, то наша поддержка на связи в боте @Butter_robot_supportBot"